tests/data/authorization_request.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><AuthorizeTransaction xmlns="https://www.pagador.com.br/webservice/pagador"><request><RequestId>782a56e2-2dae-11e2-b3ee-080027d29772</RequestId><Version>1.0</Version><OrderData><MerchantId>12345678-1234-1234-1234-1234567890AB</MerchantId><OrderId>2cf84e51-c45b-45d9-9f64-554a6e088668</OrderId><BraspagOrderId xsi:nil="true" /></OrderData><CustomerData><CustomerIdentity>12345678900</CustomerIdentity><CustomerName>José da Silva</CustomerName><CustomerEmail>jose123@dasilva.com.br</CustomerEmail><CustomerAddressData xsi:nil="true" /><DeliveryAddressData xsi:nil="true" /></CustomerData><PaymentDataCollection><PaymentDataRequest xsi:type="CreditCardDataRequest"><PaymentMethod>997</PaymentMethod><Amount>10000</Amount><Currency>BRL</Currency><Country>BRA</Country><NumberOfPayments>1</NumberOfPayments><PaymentPlan>0</PaymentPlan><TransactionType>2</TransactionType><CardHolder>Jose da Silva</CardHolder><CardNumber>0000000000000001</CardNumber><CardSecurityCode>123</CardSecurityCode><CardExpirationDate>05/2018</CardExpirationDate><SaveCreditCard>true</SaveCreditCard><AdditionalDataCollection xsi:nil="true" /></PaymentDataRequest></PaymentDataCollection></request></AuthorizeTransaction></soap:Body></soap:Envelope>
